app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales" WHERE "sales"."city" IS NULL
---
  def index

  filter = params[:city] || session[:city]

    if filter != nil then
      @sales = Sale.filter_by_city(params[:city])
    else
      @sales = Sale.all

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
---
  def show
    @sale = Sale.find(params[:id])

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
---
  def edit
    @sale = Sale.find(params[:id])

INSERT INTO "sales" ("city", "created_at", "date", "good", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", "Mansoura"], ["created_at", Sun, 11 Jan 2015 18:28:06 UTC +00:00], ["date", Thu, 01 Jan 2015], ["good", "iphone"], ["price", 5000.0], ["updated_at", Sun, 11 Jan 2015 18:28:06 UTC +00:00]]
---
  def create
    @sale = Sale.new(params[:sale])

    respond_to do |format|
      if @sale.save

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
---
  def update
    @sale = Sale.find(params[:id])

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "101"]]
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 101]]
---
  def destroy
    @sale = Sale.find(params[:id])
    @sale.destroy